docs/perf-results.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: scripts/perf/load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 25 max VUs, 1m10s max duration (incl. graceful stop):
              * default: Up to 25 looping VUs for 40s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/25 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 01/25 VUs  01.0s/40.0s

running (0m02.0s), 02/25 VUs, 1 complete and 0 interrupted iterations
default   [   5% ] 02/25 VUs  02.0s/40.0s

running (0m03.0s), 03/25 VUs, 2 complete and 0 interrupted iterations
default   [   7% ] 03/25 VUs  03.0s/40.0s

running (0m04.0s), 04/25 VUs, 5 complete and 0 interrupted iterations
default   [  10% ] 04/25 VUs  04.0s/40.0s

running (0m05.0s), 05/25 VUs, 8 complete and 0 interrupted iterations
default   [  12% ] 05/25 VUs  05.0s/40.0s

running (0m06.0s), 06/25 VUs, 11 complete and 0 interrupted iterations
default   [  15% ] 06/25 VUs  06.0s/40.0s

running (0m07.0s), 07/25 VUs, 16 complete and 0 interrupted iterations
default   [  17% ] 07/25 VUs  07.0s/40.0s

running (0m08.0s), 08/25 VUs, 21 complete and 0 interrupted iterations
default   [  20% ] 08/25 VUs  08.0s/40.0s

running (0m09.0s), 09/25 VUs, 26 complete and 0 interrupted iterations
default   [  22% ] 09/25 VUs  09.0s/40.0s

running (0m10.0s), 09/25 VUs, 33 complete and 0 interrupted iterations
default   [  25% ] 09/25 VUs  10.0s/40.0s

running (0m11.0s), 10/25 VUs, 41 complete and 0 interrupted iterations
default   [  27% ] 10/25 VUs  11.0s/40.0s

running (0m12.0s), 11/25 VUs, 48 complete and 0 interrupted iterations
default   [  30% ] 11/25 VUs  12.0s/40.0s

running (0m13.0s), 12/25 VUs, 56 complete and 0 interrupted iterations
default   [  32% ] 12/25 VUs  13.0s/40.0s

running (0m14.0s), 12/25 VUs, 64 complete and 0 interrupted iterations
default   [  35% ] 12/25 VUs  14.0s/40.0s

running (0m15.0s), 13/25 VUs, 74 complete and 0 interrupted iterations
default   [  37% ] 13/25 VUs  15.0s/40.0s

running (0m16.0s), 14/25 VUs, 84 complete and 0 interrupted iterations
default   [  40% ] 14/25 VUs  16.0s/40.0s

running (0m17.0s), 15/25 VUs, 95 complete and 0 interrupted iterations
default   [  42% ] 15/25 VUs  17.0s/40.0s

running (0m18.0s), 15/25 VUs, 101 complete and 0 interrupted iterations
default   [  45% ] 15/25 VUs  18.0s/40.0s

running (0m19.0s), 16/25 VUs, 116 complete and 0 interrupted iterations
default   [  47% ] 16/25 VUs  19.0s/40.0s

running (0m20.0s), 17/25 VUs, 119 complete and 0 interrupted iterations
default   [  50% ] 17/25 VUs  20.0s/40.0s

running (0m21.0s), 18/25 VUs, 135 complete and 0 interrupted iterations
default   [  52% ] 18/25 VUs  21.0s/40.0s

running (0m22.0s), 19/25 VUs, 149 complete and 0 interrupted iterations
default   [  55% ] 19/25 VUs  22.0s/40.0s

running (0m23.0s), 19/25 VUs, 154 complete and 0 interrupted iterations
default   [  57% ] 19/25 VUs  23.0s/40.0s

running (0m24.0s), 20/25 VUs, 173 complete and 0 interrupted iterations
default   [  60% ] 20/25 VUs  24.0s/40.0s

running (0m25.0s), 21/25 VUs, 174 complete and 0 interrupted iterations
default   [  62% ] 21/25 VUs  25.0s/40.0s

running (0m26.0s), 21/25 VUs, 193 complete and 0 interrupted iterations
default   [  65% ] 21/25 VUs  26.0s/40.0s

running (0m27.0s), 22/25 VUs, 195 complete and 0 interrupted iterations
default   [  67% ] 22/25 VUs  27.0s/40.0s

running (0m28.0s), 23/25 VUs, 217 complete and 0 interrupted iterations
default   [  70% ] 23/25 VUs  28.0s/40.0s

running (0m29.0s), 24/25 VUs, 218 complete and 0 interrupted iterations
default   [  72% ] 24/25 VUs  29.0s/40.0s

running (0m30.0s), 24/25 VUs, 229 complete and 0 interrupted iterations
default   [  75% ] 24/25 VUs  30.0s/40.0s

running (0m31.0s), 25/25 VUs, 242 complete and 0 interrupted iterations
default   [  77% ] 25/25 VUs  31.0s/40.0s

running (0m32.0s), 25/25 VUs, 243 complete and 0 interrupted iterations
default   [  80% ] 25/25 VUs  32.0s/40.0s

running (0m33.0s), 19/25 VUs, 268 complete and 0 interrupted iterations
default   [  82% ] 19/25 VUs  33.0s/40.0s

running (0m34.0s), 19/25 VUs, 268 complete and 0 interrupted iterations
default   [  85% ] 19/25 VUs  34.0s/40.0s

running (0m35.0s), 14/25 VUs, 287 complete and 0 interrupted iterations
default   [  88% ] 14/25 VUs  35.0s/40.0s

running (0m36.0s), 14/25 VUs, 287 complete and 0 interrupted iterations
default   [  90% ] 14/25 VUs  36.0s/40.0s

running (0m37.0s), 10/25 VUs, 301 complete and 0 interrupted iterations
default   [  92% ] 10/25 VUs  37.0s/40.0s

running (0m38.0s), 06/25 VUs, 311 complete and 0 interrupted iterations
default   [  95% ] 06/25 VUs  38.0s/40.0s

running (0m39.0s), 06/25 VUs, 311 complete and 0 interrupted iterations
default   [  97% ] 06/25 VUs  39.0s/40.0s

running (0m40.0s), 02/25 VUs, 317 complete and 0 interrupted iterations
default   [ 100% ] 02/25 VUs  40.0s/40.0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<1000' p(95)=756.68ms
    ✓ 'p(99)<2000' p(99)=1.17s

    http_req_failed
    ✗ 'rate<0.05' rate=79.93%


  █ TOTAL RESULTS 

    checks_total.......: 1595   39.424092/s
    checks_succeeded...: 20.06% 320 out of 1595
    checks_failed......: 79.93% 1275 out of 1595

    ✓ login 200
    ✗ invoices 200
      ↳  0% — ✓ 0 / ✗ 319
    ✗ accounts 200
      ↳  0% — ✓ 0 / ✗ 319
    ✗ dashboard 200
      ↳  0% — ✓ 1 / ✗ 318
    ✗ products 200
      ↳  0% — ✓ 0 / ✗ 319

    HTTP
    http_req_duration..............: avg=138.88ms min=4.44ms  med=30.35ms  max=1.37s p(90)=426.07ms p(95)=756.68ms
      { expected_response:true }...: avg=534.12ms min=155.8ms med=425.98ms max=1.37s p(90)=945.49ms p(95)=1.17s   
    http_req_failed................: 79.93% 1275 out of 1595
    http_reqs......................: 1595   39.424092/s

    EXECUTION
    iteration_duration.............: avg=1.69s    min=1.23s   med=1.61s    max=2.54s p(90)=2.2s     p(95)=2.44s   
    iterations.....................: 319    7.884818/s
    vus............................: 2      min=1            max=25
    vus_max........................: 25     min=25           max=25

    NETWORK
    data_received..................: 1.9 MB 47 kB/s
    data_sent......................: 2.2 MB 55 kB/s



running (0m40.5s), 00/25 VUs, 319 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/25 VUs  40s
time="2026-05-17T11:34:16+07:00" level=error msg="thresholds on metrics 'http_req_failed' have been crossed"